app/views/muestras/_form.html.erb

    <%= form.label :tarea %>
    <%= form.collection_select :tarea_id, Tarea.all, :id, :nombre%>
---
SELECT `tareas`.* FROM `tareas`

    <%= form.label :empleado %>
    <%= form.collection_select :empleado_id, Empleado.where(proyecto_id: @proy_id).all, :id, :nombre %>
---
SELECT `empleados`.* FROM `empleados` WHERE `empleados`.`proyecto_id` IS NULL