app/views/muestras/index.html.erb

SELECT  `tareas`.* FROM `tareas` WHERE `tareas`.`id` = 15 LIMIT 1
---
        <td><%= muestra.temperatura %></td>
        <td><%= Tarea.find(muestra.tarea_id).nombre %></td>