app/controllers/administrar_controller.rb

  def permisos
  @usuarios = User.all
---
SELECT `users`.* FROM `users`

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 1

  def ascender
  	usuario = User.find(params[:usuario_id].to_i)
  	#puts(params[:usuario_id].to_i)
  	usuario.update_attribute(:permission, 1)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `permission` = 1, `updated_at` = '2018-04-02 05:41:51' WHERE `users`.`id` = 4

  def descender
  	usuario = User.find(params[:usuario_id])
  	usuario.update_attribute(:permission, 0)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `permission` = 0, `updated_at` = '2018-04-02 05:42:09' WHERE `users`.`id` = 4