app/controllers/empleados_controller.rb

SELECT  `empleados`.* FROM `empleados` WHERE `empleados`.`proyecto_id` = 2 LIMIT 1
---
  def index

    if params[:from_proyecto]
        session[:proyecto_id] = params[:proyecto_id]
    end
    proy_id = session[:proyecto_id].to_i
    @empleados = Empleado.where(proyecto_id: proy_id).all

INSERT INTO `empleados` (`nombre`, `descripcion`, `tipo`, `created_at`, `updated_at`) VALUES ('El gato', 'un empleado', 0, '2018-04-02 01:56:25', '2018-04-02 01:56:25')
---
  def create
    local_params = empleado_params;
    local_params[:tipo] = 0;
    local_params[:proyecto_id] = session[:proyecto_id]

    @empleado = Empleado.new(local_params)

    respond_to do |format|
      if @empleado.save

SELECT  `empleados`.* FROM `empleados` WHERE `empleados`.`id` = 1 LIMIT 1
---
    def set_empleado
      @empleado = Empleado.find(params[:id])