app/controllers/empleados_controller.rb

SELECT `empleados`.* FROM `empleados`
---
  def index
    @empleados = Empleado.all