app/controllers/muestreos_controller.rb

SELECT `muestreos`.* FROM `muestreos` WHERE `muestreos`.`proyecto_id` = 2
---
  def index




    if params[:from_proyecto]
        session[:proyecto_id] = params[:proyecto_id]
    end
    proy_id = session[:proyecto_id].to_i
    @muestreos = Muestreo.where(proyecto_id: proy_id).all