app/controllers/muestras_controller.rb

  def index
    @muestras = Muestra.all
---
SELECT `muestras`.* FROM `muestras`

  def show
     muestra = Muestra.find(params[:id])
     @empleado = Empleado.find(muestra.empleado_id)
     @tarea = Tarea.find(muestra.tarea_id)
---
SELECT  `muestras`.* FROM `muestras` WHERE `muestras`.`id` = 1 LIMIT 1
SELECT  `empleados`.* FROM `empleados` WHERE `empleados`.`id` = 2 LIMIT 1
SELECT  `tareas`.* FROM `tareas` WHERE `tareas`.`id` = 15 LIMIT 1

  def create

    local_params = muestra_params;
    local_params[:muestreo_id] = session[:muestreo_id]
    @muestra = Muestra.new(local_params)
    #render inline: "<%= @local_params %>"

    respond_to do |format|
      if @muestra.save
---
INSERT INTO `muestras` (`muestreo_id`, `hora`, `humedad`, `temperatura`, `created_at`, `updated_at`, `tarea_id`, `empleado_id`) VALUES (1, '2018-04-02 06:20:00', 12.0, 11.0, '2018-04-02 06:21:06', '2018-04-02 06:21:06', 15, 1)

  def destroy
    @muestra.destroy
---
DELETE FROM `muestras` WHERE `muestras`.`id` = 1

    def set_muestra
      @muestra = Muestra.find(params[:id])
---
SELECT  `muestras`.* FROM `muestras` WHERE `muestras`.`id` = 1 LIMIT 1