app/controllers/muestreos_controller.rb

  def index


    @muestreos = Muestreo.all
---
SELECT `muestreos`.* FROM `muestreos`

  def create

    local_params = muestreo_params
    local_params[:proyecto_id] = session[:proyecto_id]

    @muestreo = Muestreo.new(local_params)
    #@id = local_params
    #render inline: "<%= @id %> "
    respond_to do |format|
      if @muestreo.save
---
INSERT INTO `muestreos` (`fecha_inicio`, `fecha_fin`, `meta`, `proyecto_id`, `created_at`, `updated_at`) VALUES ('2018-02-22 03:18:00', '2018-02-22 03:18:00', 20, 1, '2018-02-22 03:18:17', '2018-02-22 03:18:17')

  def destroy
    @muestreo.destroy
---
DELETE FROM `muestreos` WHERE `muestreos`.`id` = 1

    def set_muestreo
      @muestreo = Muestreo.find(params[:id])
---
SELECT  `muestreos`.* FROM `muestreos` WHERE `muestreos`.`id` = NULL LIMIT 1