app/controllers/proyectos_controller.rb

SELECT `proyectos`.* FROM `proyectos`
---
  def index
    @proyectos = Proyecto.all

INSERT INTO `proyectos` (`fecha_inicio`, `descripcion`, `created_at`, `updated_at`) VALUES ('2018-02-18 05:38:00', 'Algun proyeto', '2018-02-18 05:39:05', '2018-02-18 05:39:05')
---
  def create
    @proyecto = Proyecto.new(proyecto_params)

    respond_to do |format|
      if @proyecto.save

DELETE FROM `proyectos` WHERE `proyectos`.`id` = 4
---
  def destroy
    @proyecto.destroy

SELECT  `proyectos`.* FROM `proyectos` WHERE `proyectos`.`id` = NULL LIMIT 1
---
    def set_proyecto
      @proyecto = Proyecto.find(params[:id])