app/controllers/tareas_controller.rb

  def index
    @tareas = Tarea.all
---
SELECT `tareas`.* FROM `tareas`

  def create
    local_params = tarea_params
    #productivo son 2 puntos
    #colaborativo 1 puntos
    #improductivo 0 puntos
    if(local_params[:pro_type] == "Productiva")
        local_params[:pro_type] = 2;
    elsif(local_params[:pro_type] == "Colaborativa")
        local_params[:pro_type] = 1;
    else
        local_params[:pro_type] = 0;
    end

    @tarea = Tarea.new(local_params)
    puts("My object: #{@tarea_params.inspect}")
    respond_to do |format|
      if @tarea.save
---
INSERT INTO `tareas` (`nombre`, `descripcion`, `created_at`, `updated_at`) VALUES ('Cavar', 'El empleado utiliza la pala para hacer un hueco', '2018-02-22 04:18:36', '2018-02-22 04:18:36')

  def destroy
    @tarea.destroy
---
DELETE FROM `tareas` WHERE `tareas`.`id` = 7

    def set_tarea
      @tarea = Tarea.find(params[:id])
---
SELECT  `tareas`.* FROM `tareas` WHERE `tareas`.`id` = 15 LIMIT 1